---
kind: method
id: M:Autodesk.Revit.DB.ViewSchedule.IsValidTextTypeId(Autodesk.Revit.DB.ElementId)
zh: 明细表
source: html/c317e99b-f751-e8ce-87f3-0ffb56e4cd61.htm
---
# Autodesk.Revit.DB.ViewSchedule.IsValidTextTypeId Method

**中文**: 明细表

Identifies if the input id represents a valid text type id for use in the schedule properties.

## Syntax (C#)
```csharp
public bool IsValidTextTypeId(
	ElementId textTypeId
)
```

## Parameters
- **textTypeId** (`Autodesk.Revit.DB.ElementId`) - The element id of the text type.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null